[
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/general-information",
        "title": "General Information\r\n",
        "text": "General Information HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoGeneral InformationGeneral InformationGeography and Population Kingdom of Morocco is located at North Africa. It is bordered to the north by the Mediterranean Sea and to the west by the Atlantic Ocean, where Strait of Gibraltar is located between both coasts. It is bordered to the south by Mauritania and to the east by Algeria. The total area of the Kingdom of Morocco is 710,850km2. The coastline is 3,500km long. Climate is generally mild, particularly in the north area, where rains are heavier in winter. However, winter is harsher in the internal regions and mountain area, where temperature decreases giving way to snowfall. Summer is hot and rains are rare. The varied climate led to variety of plants. The north is known for cedar forests, green oak, cork trees and Argania spinosa, while the arid or semi-arid zone and oases are known for halva plants and cactus. Population is around 33,848,242 according to 2014 statistics, where the population in the cities reaches 60.3% and the indigenous Amazigh (Berber) is over 60%. The rest of people are the descendents of Arab, Andalusian (Morskjon), African and Jewish origins. The official languages are Arabic and Tamazight, in addition to the French language which is still predominant among Moroccan people, in government dealings and education. Morocco's predominant religion is Islam. Morocco's constitution of 2011 states that \"Morocco is an Islamic country of entire sovereignty …\" and that \"Islam is the religion of the State, which guarantees to all the free exercise of belief.\" Furthermore, Morocco's constitution of 2011 stipulates that \"The King is the Commander of the Faithful [Amir Al Mouminine], sees to the respect for Islam …\". Ninety nine percent of the Moroccan people adopt the Maliki-Ashari school of Sunni Islam and follow Tariqat Junayd Al-Salek. There is a Jewish minority which coexisted for long with the other groups in the Moroccan society. Infrastructure Road network 57,334 km/ main and secondary roads. 772 km/ Express ways. 1,800 km/ highways. Railway Roads Railway road is 2,110km long. Port Network Kingdom of Morocco has 24 ports; of which there are 11 trade and fishing ports. The most important ports are Tangier Med, Casablanca, Safi, Mohammedia, Agadir, Nador-Beni Ansar and Jorf Lasfar. Airport Network Kingdom of Morocco has 56 airports; 12 thereof are international airports. The most important airports are Mohammed V International Airport, Rabat-Sale Airport, Agadir–Al Massira International Airport, Fes Saiss Airport, Marrakech Menara Airport, Tangier Ibn Battouta Airport, Sania Ramel Airport in Tetouan, Oujda Angads Airport, Hassan I Airport in El Aaiun, Cherif Al Idrissi Airport in Al Hoceima, Ouarzazate Airport and Nador Aroui International Airport. Moroccan Most Important Universities Mohammed V University at Agdal in Rabat. Mohammed V University at Souissi in Rabat. Moulay Ismail University in Meknes. Al Qaraouyine University in Fes. Sidi Mohamed Ben Abdellah University in Fes. University of Hassan II in Muhammadiyah. University of Ibn Tofail in Kenitra. University of Ibn Zahr in Agadir. Mohammed I University in Oujda. Al Akhawayn (Private) University in Ifrane. Cadi Ayyad University in Marrakech. Chouaib Doukkali University in El Jadida. Hassan First University in Settat. University Hassan II in Ain Chock in Casablanca. Abdul Malik Essaadi University in Tetouan. There are various specialized institutions, including: High Technology School. Hassan II Institute of Agronomy & Veterinary Medicine. Higher Institute of Information and Communication. National Institute of Statistics and Applied Economics. National Institute of Posts and Telecommunications. The Higher Institute of Maritime Studies (ISEM). The Higher Institute of Dramatic Art and Cultural Activation. School of Tourism and Hospitality. The Higher Institute of Fine Arts. Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    },
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/foreigners-residence",
        "title": "Foreigners Residence\r\n",
        "text": "Foreigners Residence HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoForeigners Residence Foreigners Residence Foreigners desiring to reside in Morocco must obtain a Registration Card or a Residence Card, which is dealt with as a residence permit, allowed to be delivered to the internal administrative authorities within 48 hours. Furthermore, the receipt of the Residence Card application or renewal application may be temporarily used as an alternate of the Registration Card. Such application shall be submitted to the nearest \"National Security\" or the Royal Moroccan Gendarmerie to the relevant person's residence place against MAD 100 per annum during the period of validity thereof. Documents required for the residence of foreigners in Morocco To obtain or renew a card registration by foreigner desiring to reside in Morocco, foreigners must submit an application attached to the following documents: Copy of the passport pages proving the relevant person's: Identity. Entry stamp to the Kingdom of Morocco. Entry visa for foreigners, subject to this measure. Print of the filled in registration card application in two copies. Recent photograph. Rental contract, title deed or other document, which proves the actual residence in a stable place of residence in Morocco. Copy of the criminal record. Medical certificate. A bank certificate proving sufficient means of subsistence for the period of residence in the Kingdom of Morocco. Document, which shows the nature of the activity desired to be practiced, if required. Documents required to obtain a \"visitor\" registration card by foreigners To obtain a \"visitor\" registration card by foreigners in Morocco, foreigners must submit an application attached to the following documents: Copy of the passport pages proving the relevant person's: Identity. Entry stamp to the Kingdom of Morocco. Entry visa for foreigners subject to this measure. Print of the filled in registration card application in two copies. Recent photograph. Rental contract, title deed or other document, which proves the actual residence in a stable place of residence in Morocco. Copy of the criminal record. Medical certificate. A bank certificate proving sufficient means of subsistence for the period of residence in the Kingdom of Morocco. Document, which proves that the relevant person obtained a \"visitor\" visa for foreigners subject to this measure. A declaration on honor for professional inactivity during the period of residency in the Kingdom of Morocco. Documents required to obtain a \"for work reasons\" registration card by foreigners To obtain a registration card that bears the mention \"for work reasons\" by foreigners, foreigners must submit an application attached to the following documents: Copy of the passport pages proving the relevant person's: Identity. Entry stamp to the Kingdom of Morocco. Entry visa for foreigners subject to this measure. Print of the filled in registration card application in two copies. Recent photograph. Rental contract, title deed or other document, which proves the actual residence in a stable place of residence in Morocco. Copy of the criminal record. Medical certificate. A bank certificate proving sufficient means of subsistence for the period of residence in the Kingdom of Morocco. Document, which proves that the relevant person obtained a visa that bears the mention \"for work reasons\" for foreigners subject to this measure. A certified work contract by the government authority governing the assignment of the relevant job. Documents required to obtain a \"student\" registration card by foreigners To obtain a registration card that bears the mention \"student\" by foreigners, foreigners must submit an application attached to the following documents: Copy of the passport pages proving the relevant person's: Identity. Entry stamp to the Kingdom of Morocco. Entry visa for foreigners subject to this measure. Print of the filled in registration card application in two copies. Recent photograph. Rental contract, title deed or other document, which proves the actual residence in a stable place of residence in Morocco. Copy of the criminal record. Medical certificate. A bank certificate proving sufficient means of subsistence for the period of residence in the Kingdom of Morocco. Document, which proves that the relevant person obtained a visa that bears the mention \"student\" for foreigners subject to this measure. An evidence that the relevant person is approved to study in Morocco. Documents required to obtain a residence card by a foreign husband of a Moroccan national wife or a foreign wife of a Moroccan national husband To obtain a residence card by a foreign husband of a Moroccan national wife or a foreign wife of a Moroccan national husband, foreigners must submit an application attached to the following documents: Copy of the passport pages proving the relevant person's: Identity. Entry stamp to the Kingdom of Morocco. Entry visa for foreigners subject to this measure. Print of the filled in registration card application in two copies. Recent photograph. Rental contract, title deed or other document, which proves the actual residence in a stable place of residence in Morocco. Copy of the criminal record. Medical certificate. A marriage contract that proves the existence of a marital relationship. A dwelling statement that proves that both spouses live in the same place. Residence card for foreigners Residence card is delivered to Moroccans as well as foreigners by the public competent departments. Residence card proves that its holder lives in the address referred to therein. For further clarification, documents related to the procedure of obtaining a residence card shall be filed with the competent authorities within 90 days, as soon as the relevant person enters Morocco or prior to the expiry of the visa given to foreigners, subject to this procedure, who are above 18. The applicant should have resided in Morocco for more than four consecutive years, except for the following cases: A foreign husband of a Moroccan national wife or a foreign wife of a Moroccan national husband. A foreign child of a Moroccan national mother, a stateless child of a Moroccan mother, a foreigner who has refugee status and its wife and minor children. Foreign father or mother of a child who resides and is born in Morocco and holds a Moroccan nationality. Foreign husband and minor children of a foreign husband, who have a residence card. A foreigner who proved that its regular place of residence is Morocco for more than 15 years or since it was 10 years or who has a legal status 10 years ago. Any grounds that support a foreigner's desire to reside temporarily or permanently in Morocco such as having a professional activity or means of subsistence therein shall be taken into consideration. Documents required Documents required to be submitted within 90 days at most from the date that the relevant foreigner enters Morocco or prior to the expiry of the visa granted to the foreigners, subject to this procedure or who are above 18: Copy of the passport that proves the identity and nationality of its holder (this document is not required in case of renewal of the residence card). Filling in two prints with the nearest National Security authority or Royal Moroccan Gendarmerie to the relevant person's residence place. 6 Photographs (2.5 x 2.5) and a bank certificate proving sufficient means of subsistence for. Copy of a title deed, rental contract, water, electricity or telephone bill, an accommodation certificate or statement of the dwelling owner, which proves the place of residence. In addition to the previous documents, the applicant shall be required to give a statement of the following: A document that proves professional, educational, or commercial activity or marital relationship. A foreigner who desires to obtain a residence card, which bears the mention \"visitor\" must prove that it has sufficient resources to depend on and must declare that it shall not practice any professional activity that requires a license during the period of residency in the Kingdom of Morocco. A foreigner who desires to obtain a residence card, which bears the mention \"student\" must prove that it studies in Morocco and has sufficient means of subsistence for the period of residence in the Kingdom of Morocco. A foreigner who desires to obtain a residence card, which bears the mention licensed \"professional activity\" must prove that it has obtained such license. The applicant should have resided in Morocco for more than four consecutive years, except for the cases set forth in Article (17) of the Royal Decree No. 1.03.196 issued on 11th, November 2003 regarding the Entry and Residency of Foreigners in the Kingdom of Morocco and Illegal Immigration shown in the following: A foreign husband of a Moroccan national wife or a foreign wife of a Moroccan national husband. A foreign husband of a Moroccan national wife or a foreign wife of a Moroccan national husband. A foreign child of a Moroccan national mother or a stateless child of a Moroccan mother. Foreign father or mother of a child who resides and is born in Morocco and holds a Moroccan nationality. Foreign husband and minor children of a foreign husband, who have a residence card. A foreigner who has refugee status and its wife and minor children. A foreigner who proved that its regular place of residence is Morocco for more than 15 years or since it was 10 years or who has a legal status for more than 10 years. Grounds for the availability of means of subsistence of the concerned person shall be taken into consideration upon the approval or rejection of the residence card application, including the circumstances of the practice of professional activity or, if required, the facts that may be taken as a justification of the concerned person's desire to reside permanently in Morocco. Applications shall be filed with the nearest territorial security jurisdictions, regional security jurisdictions, Police Regional office to the place of residence of the concerned person or the Royal Moroccan Gendarmerie for those living in desert areas. For more information, kindly refer back to Law No. 02.03 concerning the Entry and Residence of Foreigners in Morocco and Illegal Immigration promulgated in execution of the Royal Decree No. 1.03.196 dated 16th, Ramadan 1424 (11th, November 2003) or see the following government website: http://www.service-public.ma Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    },
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/do-and-dont",
        "title": "Do and Don't\r\n",
        "text": "Do and Don't HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoDo and Don'tDo and Don't Moroccan society is an open and conservative society at the same time, close to the customs and traditions and norms in many Arab and Islamic countries, so all that applies to the citizens of their country of origin shall be valid in the Kingdom of Morocco. Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    },
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/political-system",
        "title": "Political System\r\n",
        "text": "Political System HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoPolitical SystemPolitical SystemKingdom of Morocco is a constitutional monarchy as it was first set forth in the constitution of 1962. The following constitutions till 2011 maintained the same provision. The king has the highest authority in the state, being the Commander of the Faithful (Amir Al Mouminine) and highest commander of the Royal Moroccan Armed Forces. The king has several authorities and powers such as choosing the prime minister from political party, which won the elections, removal of ministries and termination of the parliament and government, if necessary. The king also heads the Supreme Council of the Judiciary. The Parliament of Morocco is the bicameral legislature. It is formed of two parliamentary chambers: the House of Representatives and the House of Councillors. The House of Representatives is formed of 395 members, who are elected directly for a five-year term, while the House of Councillors has not less than 90 and not more than 120 members. They are elected indirectly for a six-year term. The Parliament is composed of territorial groups, municipality councils, professional chambers and elected representatives. Administrative division of regions Tangier-Tetouan region. Tagmuant and Rif region. Fes-Meknes region. Rabat-Sale-Kenitra region. Beni Mellal-Khenifra region. Casablanca-Settat region. Draa-Tafilalet region. Souss-Massa region. Guelmim-Oued Noun region. Laayoune-Sakia El Hamra region. Dakhla-Oued Ed-Dahab region. Political parties and currents and civil society organizations Political parties represented in the Parliament of Morocco Justice and Development Party: it is an Islamist party, which emerged from the Constitutional People Movement in 1997/ 125 seats. Authenticity and Modernity Party: it emerged from the Movement of All Democrats formed in 2008/ 102 seats. Istiqlal Party: it is an old party established before the independence of Morocco on 1944. It was headed by the leaders of the National Movement/ 46 seats. National Rally of Independents Party: it is a centre-right party. It was formed in 1978/ 37 seats. Popular Movement: it is one of the political parties, which were formed in 1959/ 27 seats. Socialist Union of Popular Forces: it is a left wing party established in 1974 after the split from the National Union for Popular Forces, which emerged from Istiqlal Party/ 20 seats. Constitutional Union Party: it is a right-wing party established in 1983/ 19 seats. Party of Progress and Socialism: it is a left wing party/ 12 seats. Democratic and Social Movement: it is a party established in 1997after split from the National Popular Movement/ 3 seats. Green Left Party: it is a moderate left organization, which is concerned with environmental issues. It was established in 2010/ 2 seats. The Federation of the Democratic Left: it is a conglomerate of several left parties and currents; the most prominent of which is the Party of the Unified Socialist Left and The National Vanguard Party/ 2 seats. Unity and Democracy Party/ 1 seat. Moroccan Civil Organizations The Moroccan Human Rights Organization. Moroccan Association for Human Rights. The Moroccan League for the Defense of Human Rights (MLDHR). Moroccan National Observatory for Children's Rights. National Department for Public Funds Protection. Federation of the Democratic League for Women's Rights. The Union of Feminine Action. The Moroccan Association for Women's Rights. The Democratic Association for Women's Rights. Lalla Salma Foundation - Prevention and Treatment of Cancers. The Moroccan Association for the Fight against AIDS. Bayti Association. Maroc Cultures Association. Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    },
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/tourism",
        "title": "Tourism\r\n",
        "text": "Tourism HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoTourismTourismThe most important tourist sites in cities of Morocco: Rabat: characterized by several historic monuments most important Chellah and Kasbah Oudayas and Hassan Tower and the old city and home to several museums and old libraries and historic palaces. Casablanca: includes several religious and historical tourist effects, such as the old city and the Hassan II mosque, and Mohammed V Square. Fez: Mosque of the villagers, the school Buinaniya, the mausoleum of Moulay Idriss, the old city, the ancient Casbah, Jinan way, and a number of archaeological museums. Tetouan: Basha Mosque, Almcypr door, the door of the horizontal bar, Arts Museum, Rue porch, Museum excavations Square, Hassan II, in addition to the tourist beaches on the shores of the Mediterranean. Marrakech: includes several historic monuments most important Badi Palace, Koutoubia silo, Menara, Saadian tombs, the tomb of the poet based Ibn Abbad, the tomb of Yusuf ibn tachfin, Djemaa el Fna, the old city. Agadir: a modern tourist city which has tourist resorts sophisticated and attract European tourists. Ifrane: a tourist city, where trees grow rice, the atmosphere is characterized by a mild summer and cold in winter, where falling amounts of snow which attracts amateurs skating on ice. Morocco is also available on other tourist areas such as Lake sporadic (Okelmam Azkza) located on the outskirts of the city of Khenifra and the headwaters of the eyes (OM Rbie) and in the same area (Ein Sultan) and (Dayet AWA) and many other sites. For hotel reservations and learn about the scenery and tourist monuments in the Kingdom of Morocco, please visit the following sites: www.visitmorocco.com/index.php/ara www.tourisme.gov.ma/index_ar.htm Weather Condition www.marocmeteo.ma Prayer Time www.habous.gov.ma Times of Trains http://www.oncf.ma/Pages/Horaires.aspx Pharmacies guard http://pratique.menara.ma/fr/Pratique/Pharmacie%20de%20garde/ Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    },
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/family-law",
        "title": "Family Law\r\n",
        "text": "Family Law HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoFamily LawFamily LawMoroccan Family Law/ Personal Status Code Moroccan Family Law promulgated on 05th, February, 2005 is considered the Personal Status Code. It deals with issues of marriage, divorce, inheritance and other family-related issues. The Moroccan Family Law was approved after thorough discussion contributed by most of the Moroccan political and right currents. This discussion resulted in high tension between Islamic and secular currents, which ended by the intervention of King Mohammed VI. The final statement of the Family Code, which is based on several principles, including equality of spouses in respect of rights and duties, restriction of minor girls' marriage, setting marriage age at 18, rendering family as an institution under the responsibility of both spouses, entitlement of the right to tutelage for women who have come of age, judiciary control of divorce and the principle of dividing earned money during the spouses being bonded by the marital bond. On the other side, the Family Code decides that the Public Prosecution is a major party in all the issues related to putting the Code in effect. Furthermore, it set a family jurisdiction, recognized civil marriage concluded between individuals of Moroccan communities with the local authorities in the countries of residence. In this context, the Family Code worked on providing children with the necessary protection through taking care of their social conditions upon parents' separation and providing them with the same standard of dwelling and living they used to have before their parents' divorce. Moreover, the Family Code recognized the validity of blood kinship relations for babies born during engagement. For more information, please visit the following link: Family Code Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    },
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/important-phones",
        "title": "Important Phones\r\n",
        "text": "Important Phones HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoImportant PhonesImportant Phones 160: Information Service 120: International Information Service 19: Police(From Fixed Phone) 112: Police (from a mobile phone) 15: Firefighters and casualty 177: Royal Gendarmerie +212537672121 : Qatar Airways Rabat: United Nations Sanatorium: Address: Ibn Hanbal passage, the United Nations’s Street Phone Number: 0537670505 Rabat: Rapid Ambulance Service: 0537737373 Rabat: Sheikh Zayed University Hospital: Allal El Fassi, Manidat Al Irfane ,Hay Riad Rabat. Phone Number: 0537686868 Marrakech / International clinic, Egli door, Airport Road, phone number 0543699595. Casablanca / Khalifa Bin Zayed Hospital, Mohammad Al Tayeb Al Nasri Street, , Um Alrabei , Al Hassani District Casablanca, phone number 0529004488. Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    },
    {
        "url": "https://rabat.embassy.qa/en/kingdom-of-morocco/faq",
        "title": "FAQs\r\n",
        "text": "FAQs HomeTerms & ConditionsSite MapContactعربيQatar Embassy in Rabat - Kingdom of Morocco Toggle navigationTHE EMBASSYABOUT USAMBASSADOREMBASSY MEMBERSFORMER AMBASSADORSOFFICIAL HOLIDAYSCONTACTQATARPOLITICAL SYSTEMQATAR TODAYECONOMY TODAYKINGDOM OF MOROCCOGENERAL INFORMATIONPOLITICAL SYSTEMQATAR - MOROCCO RELATIONSTOURISMCUSTOMS PROCEDURESFAMILY LAWFOREIGNERS RESIDENCEDO AND DON'TFAQSIMPORTANT PHONESSERVICESCONSULAR SERVICESEDUCATIONAL SERVICESMEDIANEWSEVENTSCITIZEN REGISTRATIONHomeKingdom of MoroccoFAQsFAQsWhat do you do if you lose your passport? A Statement of loss issued by Security Authorities and certified by the Moroccan Ministry of Foreign Affairs. A request addressed to the head of the mission to get a ticket passage. A copy of the passport missing, if any. 2 portraits. What are the documents required to renew your passport? The original passport. The presence of the applicant himself and asked to sign a replacement passport application form to the employee, as well as gave the passport to its owner personally after the issuance of the passport. A model seal by the embassy after being signed by the applicant. Attachment of the application with value of QR 50 or equivalent and 3 personal photos in size (3.7 * 4.7 cm) with Leaden or Gray background. What are the documents required to complete the proceedings of marriage for Qatari citizens with the carriers of Moroccan nationality?First An approval by the Qatari Ministry of Interior for marriage. An approval by the Qatari Ministry of the Interior to grant the visa of entry. Second A good conduct certificate. Work Certificate that shows Statement of salary. Certificate showing marital status: (married / Absolute / Single / widowed). The consent of the first wife in case he was married. Note All certificates must be mentioned above is certified by: Ministry of Foreign Affairs. Embassy of the Kingdom of Morocco in Doha. Third A copy of the passport. A copy of the identity card. A copy of birth certificate. Embassy of the State of Qatar N°2 AV MOHAMED SIX Route AKRACH, LOT RISSANIADAR ESSALAM SOUISSI, RABAT +212537544544 rabat@mofa.gov.qa Amiri DiwanMinistry Of Foreign Affairs - QatarThe Diplomatic InstituteExpo 2023Qatar EmbassyRabat - Kingdom of MoroccoThe EmbassyAbout UsAmbassadorEmbassy Members Former AmbassadorsOfficial HolidaysContactQatarPolitical SystemQatar TodayEconomy TodayKingdom of MoroccoGeneral InformationPolitical SystemQatar - Morocco RelationsTourismCustoms ProceduresFamily LawForeigners Residence Do and Don'tFAQsImportant PhonesServicesConsular ServicesEducational ServicesMediaNewsEventsCitizen RegistrationEmbassy of the State of Qatar20, Rue Zerhoun Souissi Rabat - Kingdom of Morocco+212537544544+212537544500rabat@mofa.gov.qaTwitterCopyright © 2020 Ministry of Foreign Affairs. All rights reserved. Terms & Conditions."
    }
]