[
    {
        "url": "https://www.cafonline.com/caf-africa-cup-of-nations/news/totalenergies-afcon-2025-in-morocco-everything-you-need-to-know/",
        "title": "TotalEnergies AFCON 2025 in Morocco: Everything you need to know",
        "text": "TotalEnergies AFCON 2025 in Morocco: Everything you need to know Inside CAF Competitions News Press Release Documents français English العربية All sections Media Channel Press Release News Center Videos Member Associations Women's Football CAF Store Men Clubs Women Youth About us Caf History Caf President Organization Legal Tenders Careers Football Development Club Licensing Medical Refereeing Safety and Security Official Documents Competitions regulations Medical Statutes Club Licensing Executive Committee Finance Refereeing Safety and Security Competitions Men Clubs Women Youth Media Channel Press Release News Center Videos Member Associations Women's Football CAF Store About us Caf History Caf President Organization Legal Tenders Careers Football Development Club Licensing Medical Refereeing Safety and Security Official Documents Competitions regulations Medical Statutes Club Licensing Executive Committee Finance Refereeing Safety and Security français English العربية Close Popular searches CAF Champions League CAF Confederation Cup CAF Women Champions League AFCON TotalEnergies CAF Africa Cup of Nations (AFCON) Cote d’Ivoire 2023 Press release Recent searches HOME NEWS VIDEOS QUALIFIERS ARCHIVE CAF TotalEnergies CAF Africa Cup of Nations News TotalEnergies AFCON 2025 in Morocco: Everything you need to know TotalEnergies AFCON 2025 in Morocco: Everything you need to know Published: Wednesday, 20 November 2024 The countdown to the 2025 TotalEnergies Africa Cup of Nations (AFCON) has officially begun as the North African nation of Morocco prepares to host the continent’s premier football tournament for the second time in its history. With the qualifiers over and the 24 teams to play in the competition known, here's a comprehensive guide to what fans can expect from the 35th edition of this iconic competition. A Return to Morocco Morocco last hosted the Africa Cup of Nations in 1988, a tournament that saw just eight teams compete, with Cameroon emerging victorious after a hard-fought final against Nigeria. Fast forward to 2025, and the tournament has expanded significantly, with 24 teams set to compete, highlighting the growth and development of African football over the past three decades. Morocco was confirmed as the host nation on September 27, 2023, a decision that has been met with widespread enthusiasm. The Atlas Lions, who automatically qualify as the host nation, are eager to showcase their country’s readiness to host a competition of this magnitude, especially after their historic performance in the 2022 FIFA World Cup, where they became the first African nation to reach the semi-finals. Stadiums and Host Cities While the Royal Moroccan Football Federation has yet to officially announce the venues, several iconic stadiums are expected to play a central role in the tournament. These include: Mohammed V Stadium, Casablanca: A likely centerpiece of the tournament, this historic venue hosted the 1988 AFCON final and is expected to be a major venue once again. Moulay Abdellah Stadium, Rabat: Another key venue, currently undergoing expansion to increase its capacity. Ibn Batouta Stadium, Tangier: Set to host some of the tournament's biggest matches, with an expanded capacity to accommodate more fans. Adrar Stadium, Agadir: Known for its stunning location and modern facilities, also being expanded ahead of the tournament. Marrakesh Stadium, Marrakesh: A popular venue with fans and likely to see significant action during the tournament. Fez Stadium, Fez: A more traditional setting that will add to the diverse experiences offered to fans. Qualifiers and Teams While Morocco was the only team currently assured of a place in the tournament as the host nation, the remaining 23 spots was decided through a rigorous qualifying process. The qualifiers, which kicked off in September 2024 and ending in November 2024, saw 48 nations divided into 12 groups, with the top two teams from each group securing their place in Morocco. The qualification process was intense, with teams like reigning champions Côte d'Ivoire, Egypt, Nigeria, Senegal, and Algeria all vying for a spot. Most of the giants secured their places while others like Ghana and Guinea could not qualify for the competition. The 24 countries qualified for TotalEnergies CAF AFCON 2025 Morocco (Hosts) Burkina Faso Cameroon Algeria DR Congo Senegal Egypt Angola Equatorial Guinea Cote d'Ivoire Uganda South Africa Gabon Tunisia Nigeria Zambia Mali Zimbabwe Comoros Sudan Benin Tanzania Botswana Mozambique Key Dates The 2025 AFCON is scheduled to begin on December 21, 2025, and will culminate with the final on January 18, 2026. These dates are crucial for fans and teams alike as they prepare for the most prestigious football tournament on the African continent. Morocco's Growing Football Reputation Morocco’s selection as the host for AFCON 2025 is no surprise given the country’s recent track record in successfully hosting major international football events. From the 2018 African Nations Championship (CHAN) to the 2022 Women’s Africa Cup of Nations and the FIFA Club World Cup in 2023, Morocco has consistently demonstrated its capacity to organize and deliver world-class football tournaments. This track record, combined with the country’s passionate football culture and state-of-the-art infrastructure, sets the stage for what could be one of the most memorable editions of the Africa Cup of Nations. Looking Ahead As the road to Morocco 2025 begins, anticipation is high not just for the tournament itself but for what it symbolizes—a celebration of African football and a showcase of Morocco’s commitment to the sport. With world-class facilities, a football-mad population, and recent experience in hosting major tournaments, Morocco is poised to deliver an AFCON that will set new benchmarks for the competition. Related News Title Sponsor Official CAF Partners Official Supplier Press Release Member Associations News Center Videos Competitions CAF Women's Football About us Caf History Caf President Organization Legal Tenders Careers Official Documents Official Documents Competitions regulations Medical Statutes Club Licensing Executive Committee Finance Refereeing Safety and Security Development Football Club Licensing Medical Refereeing Safety and Security Connect with us Address 3 Abdel Khalek Tharwat Street, El Hay El Motamayez, P.O. Box 23 6th October City, Egypt Telephone +202 382 472 72 Email info@cafonline.com Privacy Policy Cookie Policy Terms of Service All rights reserved © 2024"
    },
    {
        "url": "https://www.forbes.com/sites/sindiswamabunda/2024/11/20/afcon-2025-the-road-to-morocco-begins-as-24-teams-confirmed-for-africas-biggest-football-tournament/",
        "title": "AFCON 2025: The Road To Morocco Begins As 24 Teams Confirmed For Africa's Biggest Football Tournament",
        "text": "AFCON 2025: The Road To Morocco Begins As 24 Teams Confirmed For Africa's Biggest Football TournamentShop Our Favorite Holiday Deals!BETATHIS IS A BETA EXPERIENCE. OPT-OUT HEREMore From ForbesNov 29, 2024,03:14pm ESTReal Madrid’s Ego Has Backfired, Not So Much Kylian MbappéNov 29, 2024,01:23pm ESTElara By HGV And The Anatomy Of A Hotel During Las Vegas F1 Race WeekNov 29, 2024,12:31pm EST2024 Gift Guide For Pickleball EnthusiastsNov 29, 2024,11:52am ESTBig 12 Thankful For Tulane’s Stumble Against MemphisNov 29, 2024,11:24am ESTEberflus Coaching Dooms Bears; Defensive Injuries Hamper 11-1 LionsNov 29, 2024,11:24am ESTHurried Process That Led To Eberflus’ Hiring Hangs Over BearsNov 29, 2024,11:15am ESTIndiana Pacers Guard Quenton Jackson Stepping Into Role Amid InjuriesNov 29, 2024,10:38am ESTLittle Luis Lara Displaying Big Potential In Milwaukee Brewers’ SystemNov 29, 2024,09:52am ESTFPL Gameweek 13: Three Things To Look Out For Ahead Of Friday DeadlineEdit StoryForbesBusinessSportsMoneyAFCON 2025: The Road To Morocco Begins As 24 Teams Confirmed For Africa's Biggest Football TournamentSindiswa MabundaContributorOpinions expressed by Forbes Contributors are their own.Sindiswa Mabunda covers the sports landscape in Africa.FollowingNov 20, 2024,01:45pm ESTShare to FacebookShare to TwitterShare to LinkedinTOPSHOT - This photograph shows the trophy ahead of the Africa Cup of Nations (CAN) 2021 final ... [+] football match between Senegal and Egypt at Stade d'Olembe in Yaounde on February 6, 2022. (Photo by Kenzo TRIBOUILLARD / AFP) (Photo by KENZO TRIBOUILLARD/AFP via Getty Images)AFP via Getty Images The TotalEnergies AFCON 2025 Qualifiers are complete, the 24 teams have been confirmed, and the stage is set for the pinnacle of African football: the 2025 Africa Cup of Nations (AFCON). Fans worldwide now face a year-long wait for the 35th edition of the tournament, which is scheduled to kick off on December 21, 2025, in Morocco. With the excitement from the spectacular 2023 AFCON still fresh in the minds of fans, the upcoming championship promises to set even higher standards. Carrying Forward the Legacy of AFCON 2023 The 2023 edition of the tournament, hosted in Côte d'Ivoire, was truly extraordinary. Over 2 billion viewers tuned in globally, highlighting the competition's growing appeal. Analysts described it as the most exciting AFCON in over a decade, with a goals-per-game average of 2.47 in the group stages—the highest in 15 years. TOPSHOT - Ivory Coast's forward #15 Max-Alain Gradel (C) lifts the Africa Cup of Nations trophy on ... [+] the podium after Ivory Coast won the Africa Cup of Nations (CAN) 2024 final football match between Ivory Coast and Nigeria at Alassane Ouattara Olympic Stadium in Ebimpe, Abidjan on February 11, 2024. (Photo by FRANCK FIFE / AFP) (Photo by FRANCK FIFE/AFP via Getty Images)AFP via Getty Images Big names like Liverpool's Mohamed Salah, Al Nassr's Sadio Mane, Galatasaray's Victor Osimhen, and Manchester United's Andre Onana took center stage, showcasing world-class performances and drawing immense global interest. The participation of these internationally acclaimed stars not only enhanced the tournament's prestige but also highlighted the depth of talent emerging from Africa. CAF’s partnerships with leading broadcasters such as Sky, Canal+, and beIN Sport ensured that matches were accessible in over 180 countries, making it easier than ever for fans around the world to engage with the tournament. Looking ahead to the upcoming 2025 edition, the stage is set for these successes to be repeated, if not surpassed. MORE FROMFORBES VETTEDRefresh Your Wardrobe And Home With Quince’s Black Friday DealsByClaire EptingForbes StaffThe Best Black Friday Deals On TVs, According To Our Tech EditorByRebecca IsaacsForbes Staff Morocco: A Worthy Host Nation Morocco has demonstrated its ability to host world-class events. Following their historic semi-final appearance in the 2022 FIFA World Cup, the North African nation has made significant investments in advanced football infrastructure, ensuring top-notch facilities for both players and fans. From the vibrant streets of Casablanca to the historic charm of Marrakech, Morocco provides a unique setting for the tournament. The host nation's passion for football is palpable, and fans can anticipate a warm welcome and an atmosphere that showcases the country's rich cultural heritage. DOHA, QATAR - DECEMBER 10: Morocco fans celebrate their team's 1-0 victory in the FIFA World Cup ... [+] Qatar 2022 quarter final match between Morocco and Portugal at Al Thumama Stadium on December 10, 2022 in Doha, Qatar. (Photo by Francois Nel/Getty Images)Getty Images Who’s In: The Contenders and Underdogs The 2025 tournament promises an exciting mix of traditional powerhouses and underdog teams eager to make their mark. The reigning champions, Côte d'Ivoire, fresh off their victory in the 2023 edition, will be looking to defend their title with a squad filled with talent and determination. One standout player to watch is Karim Konaté, a young star nominated for the 2024 Ballon d'Or's Kopa Trophy. Konaté is expected to be a key player in the Ivorian lineup and will be crucial as they aim to protect their crown. The TotalEnergies AFCON 2025 Qualifiers began in September 2024 and will run until November 2024. The qualification process has been intense, with 48 nations divided into 12 groups, from which the top two teams in each group will secure their spots in Morocco. As always, the competition has been fierce, with giants like Côte d'Ivoire, Egypt, Nigeria, Senegal, and Algeria all vying for a place in the tournament. While most traditional powerhouses have secured their spots, some notable teams, such as Ghana and Guinea, have fallen short and failed to qualify. Their absence from the 2025 edition adds an element of unpredictability, making the upcoming tournament even more exciting. Senegal, featuring their influential forward Sadio Mané, will also be among the favourites as they aim to build on their impressive performance and pursue their second AFCON title. Meanwhile, Egypt, led by the dependable Mohamed Salah, will be eager to reclaim the championship and add to their record of seven AFCON titles. These teams, along with several others, are sure to provide intense competition as the tournament unfolds. Nigeria, with a blend of youth and experience, and Algeria, known for their flair and attacking style, are also expected to be frontrunners in the upcoming tournament. However, the last edition of this biennial event showed that fans should pay attention not just to the traditional powerhouses.Kabelo Seakanyeng of the Botswana team scores the first goal during the Africa Cup of Nations ... [+] Qualifiers match between Egypt and Botswana at 30 June Air Defence Stadium on November 19, 2024. (Photo by Ayman Aref/NurPhoto via Getty Images)NurPhoto via Getty Images The qualifiers featured several inspiring underdog stories. Tanzania secured their spot in the tournament with a memorable victory over Guinea, marking only their fourth appearance. Additionally, Botswana, a team with limited history in AFCON, surprised many by clinching their place with a gritty draw in Cairo. Southern Africa will also be well represented, as Mozambique qualified in dramatic fashion, adding to the excitement surrounding the tournament. All AFCON 2025 Qualified Teams: Algeria Angola Benin Botswana Burkina Faso Cameroon Comoros DR Congo Egypt Equatorial Guinea Gabon Ivory Coast Nigeria Mali Morocco (hosts) Mozambique Senegal South Africa Sudan Tanzania Tunisia Uganda Zambia Zimbabwe The Stakes for African Football AFCON is more than just a football competition; it is a celebration of African pride, culture, and unity. Each edition of the tournament not only showcases incredible athletic talent but also serves as a platform to highlight the continent’s global influence in sports.TOPSHOT - A Ghana supporter looks on during the Africa Cup of Nations (CAN) 2024 group B football ... [+] match between Mozambique and Ghana at Alassane Ouattara Olympic Stadium in Ebimpe, Abidjan on January 22, 2024. (Photo by Issouf SANOGO / AFP) (Photo by ISSOUF SANOGO/AFP via Getty Images)AFP via Getty Images CAF’s efforts to expand broadcast rights and attract commercial partnerships have already produced impressive results. The 2023 tournament generated a record $75 million in sponsorship revenue, with global brands such as TotalEnergies, 1xBet, and Orange partnering with the competition. This momentum sets the stage for Morocco 2025 to achieve even greater financial and viewership milestones. However, challenges still remain. Logistical issues that restrict fan attendance and the high cost of intra-African travel are barriers that CAF will need to address to ensure that fans across the continent can fully participate in the AFCON experience. Why 2025 AFCON Will Be Unmissable The ingredients for an unforgettable tournament are all present. With 24 teams competing for glory, the stakes are higher than ever. The blend of established giants and rising challengers promises a competition filled with drama, skill, and surprises. Additionally, Morocco's hosting capabilities, combined with the talents of Africa's finest players, create the ideal setting for another landmark moment in African football. As the tournament approaches, excitement will only continue to grow, with fans eagerly counting down the days until the opening whistle blows. Let the Countdown Begin The Africa Cup of Nations is more than just a football tournament; it reflects Africa’s passion, talent, and unity. The success of the 2023 edition has set a high standard, and all indications suggest that the 2025 AFCON will be an unforgettable event. As December 21, 2025, approaches, fans around the world will eagerly anticipate the excitement, drama, and magic that only AFCON can provide. For now, the anticipation continues to build. Let the countdown to Africa’s greatest footballing spectacle begin! Follow me on LinkedIn. Sindiswa MabundaFollowingEditorial StandardsForbes AccoladesJoin The ConversationComments One Community. Many Voices. Create a free account to share your thoughts. Read our community guidelines here.Forbes Community GuidelinesOur community is about connecting people through open and thoughtful conversations. We want our readers to share their views and exchange ideas and facts in a safe space.In order to do so, please follow the posting rules in our site's Terms of Service. We've summarized some of those key rules below. Simply put, keep it civil.Your post will be rejected if we notice that it seems to contain:False or intentionally out-of-context or misleading informationSpamInsults, profanity, incoherent, obscene or inflammatory language or threats of any kindAttacks on the identity of other commenters or the article's authorContent that otherwise violates our site's terms.User accounts will be blocked if we notice or believe that users are engaged in:Continuous attempts to re-post comments that have been previously moderated/rejectedRacist, sexist, homophobic or other discriminatory commentsAttempts or tactics that put the site security at riskActions that otherwise violate our site's terms.So, how can you be a power user?Stay on topic and share your insightsFeel free to be clear and thoughtful to get your point across‘Like’ or ‘Dislike’ to show your point of view.Protect your community.Use the report tool to alert us when someone breaks the rules.Thanks for reading our community guidelines. Please read the full list of posting rules found in our site's Terms of Service."
    }
]