[
    {
        "url": "https://www.visitmorocco.com/en/travel",
        "title": "Places to go | Moroccan National Tourist Office",
        "text": "Places to go | Moroccan National Tourist Office Kingdom of light Land of football PlaceMorocco, Land of Football English FrançaisEspañolItalianoDeutschPortugueseNederlandsРусскийSvenskaPolskiالعربية Discover Morocco Official website of the Moroccan National Tourism Office (MNTO), in charge of promoting Morocco's destination to national and international tourists History and geography History Medinas Historic landmarks Geography Historic sites and icons Art & Culture Gastronomy Local products Moroccan Traditional craft Moroccan hospitality Lifestyle Contemporary Morocco International brands Culture & cinema Modern Morocco An impressive heritage of humanity recognized by UNESCO Discover Eco-responsible, fair and sustainable tourism in Morocco Discover Places to goNature and discovery of rural heritage Chefchaouen Errachidia-Midelt-Merzouga Taroudant Azilal Ifrane Ouarzazate-Zagora-TinghirBeaches, sports and leisure activities Oujda-Saidia Dakhla Safi Al Hoceima Agadir-TaghazoutMedinas and beaches Tetouan Tangier Essaouira-Mogador El Jadida-Mazagan CasablancaMedinas & cultural heritage immersion Meknes Rabat Fez Marrakech Top destination ❤ Chefchaouen, the charming bride See & do Medina Medinas Museums & galleries Culture & Cinema Lifestyle Nature Nature & Mountains Parks & green spaces Moroccan gardens Walks & rambles Desert Sport Sport & nature Nautical sport Trekking Golf in Morocco Beach Gastronomy Shopping Wellness Suggested tours Cruises Desert break Imperial cities Road of 1000 Kasbahs Honey tour Great tour of Morocco Golf MICE Travel info Getting to Morocco Accomodation Getting around Morocco Kingdom of light Food & drinks MUST-KNOW THINGS Welcome back Land of football Travel guide Climate and seasons Formalities Moroccan National Tourist Office Language and essential vocabulary Health and well-being Currency in Morocco Time zone and calendar Means of communication Useful apps for travelling in Morocco Blog Our latest articles Golf in Morocco, a hundred-year-old history Embark on an enveloping wellness break in Morocco! An influencer quote Marina & Ben Shem Hooda All the favorites Culture Chefchaouen is considered to be the most \"instagrammable\" city in Morocco Tangier and Chefchaouen chosen for the shooting of the new Louis Vuitton All the videos Rewards & Considerations Discover SearchSearch English FrançaisEspañolItalianoDeutschPortugueseNederlandsРусскийSvenskaPolskiالعربية MENUSearch form SearchSearch Discover Morocco History and geography HistoryMedinasHistoric landmarks GeographyHistoric sites and icons Art & Culture GastronomyLocal productsMoroccan Traditional craftMoroccan hospitalityLifestyle Contemporary Morocco International brandsCulture & cinemaModern Morocco Places to go Nature and discovery of rural heritage Chefchaouen, the charming brideErrachidia-Midelt-MerzougaTaroudantAzilalIfraneOuarzazate-Zagora-Tinghir Medinas and beaches TetouanTangierEssaouira-MogadorEl Jadida-MazaganCasablanca Beaches, sports and leisure activities Oujda-SaïdiaDakhlaSafiAl HoceimaAgadir-Taghazout Medinas & cultural heritage immersion MeknesRabatFezMarrakech Top destination See & do Medina MedinasMuseums & galleriesCulture & CinemaLifestyle Nature Nature & MountainsParks & green spacesMoroccan gardensWalks & ramblesDesert Sport Sport & natureNautical sportTrekkingGolf in MoroccoBeachGastronomyShoppingWellness Suggested tours CruisesDesert breakImperial citiesRoad of 1000 KasbahsHoney tourGreat tour of MoroccoGolfMICE Travel info Getting to MoroccoAccomodationGetting around MoroccoKingdom of lightFood & drinksMUST-KNOW THINGS Welcome backLand of football Travel guide Climate and seasons Formalities Moroccan National Tourist Office Language and essential vocabulary Health and well-being Currency in Morocco Time zone and calendar Means of communication Useful apps for travelling in Morocco Blog Our latest articlesAn influencer quoteCulturevideos Rewards and considerations HomePlaces to go JavaScript is Disabled! Activate javascript for better experience Destination Agadir-Taghazout, the sun and the beach Agadir-Taghazout, an active destinationIn the west of the country, bordered by the waves of the Atlantic, Agadir is one of the pearls of Morocco. Whatever the season, the sun pours its rays and the city enjoys a pleasant climate that the trade winds still soften. Above all, its 10-kilometre-long seafront offers tourists magnificent views of the blue ocean and the opportunity to laze ... Read more Al Hoceima, a dream mediteranean destination Al Hoceima, the Mediterranean pearlBlue waters of the Mediterranean, its gentle, light waves and the coastline that outlines the contours of one of Morocco's most beautiful bays, welcome to the wonderful Al Hoceima ! The place looks like an earthly paradise. On one of its many beaches, you can relax on a deckchair, enjoy the sun during a farniente stay.Al Hoceima is not ... Read more Azilal, pearl of the Atlas Mountains Azilal and the Valley of HappinessExtend your stay in Morocco and visit the attractive town, Azilal. Located in the center of the Atlas Mountains, this city is teeming with charming landscapes. Its unique vivid culture, crafts and architecture, has contributed to develop a responsible and supportive ecotourism that attracts more and more tourists.Come and enjoy a rich and ... Read more Casablanca, modernity meets ancient charm The bustling CasablancaBeautiful palm trees lining its paths, with the Atlantic ocean over the horizon, and large business buildings in every corner : Casablanca is the economic lung of Morocco ; a bustling metropolis.Modern infrastructures are in the middle of charming districts, between Arab-Muslim heritage and legacies of the colonial period. Discover all the ... Read more Chefchaouen, the charming bride Chefchaouen, the blue diamondBuilt on a mountainside, Chefchaouen is a city with a special vibes. It unique charm gives an impression of unreality. With its blue-rinsed houses, the whole city seems to be bathed in azure. You walk around as if you were in a dream.More than just an ornament, the beautiful Chefchaouen brims with attractions. Its heritage is rich. The ... Read more Dakhla, a Robinson Crusoe experience Dakhla, the pearl of southern MoroccoLocated in the south of Morocco, Dakhla is a small part of paradise, lost between the waters of the Atlantic and the sands of the Sahara. It gives you a complete change of scenery. Kilometres of beaches expand from one side of the town to the other : an opportunity to relax, and indulge in all kinds of water activities.These shores are ... Read more El Jadida-Mazagan, the new Mazagan El Jadida-Mazagan, a multicultural cityOnce nicknamed Mazagan, this city built by the Portuguese has stood proudly since the 16th century. Its well preserved architectural treasures and the subtle mixture of both Moroccan and European cultures have earned it a place on the UNESCO World Heritage List.By visiting the mysterious cistern and its majestic vaults, cinema lovers will ... Read more Errachidia-Midelt-Merzouga, between Atlas and desert Errachidia-Midelt-MerzougaMidelt, Errachidia and Merzouga lead the east side of Morocco. The first two cities show a mountainous country with the reliefs of the Middle Atlas Mountains that draw perfect nature. This majestic setting seduces and charms its visitors. It is also from there that the caravans used to leave, loaded with food, for Timbuktu, and returning ... Read more Essaouira-Mogador, untainted beauty Essaouira-Mogador, bride of the AtlanticCrenellated walls, special wind, houses with white and blue facades, Essaouira, the ancient Mogador is the \"Bride of the Atlantic\".It is one of those coastal cities where the unique atmosphere and water activities seamlessly blend. Walk quietly in the shade of its ramparts, the very ones that draw the contours of Astapor, the red city of ... Read more Fez, the imperial pearl Fez at a glanceFez has a special atmosphere. This 13th-century city is an imperial city of long-lasting multicultural history, that reserves unexpected surprises for its visitors.Cross the walls of the famous medina of Fez, recognized by UNESCO as an outstanding universal value. Stroll through the streets of the Fez-El-Bali district. The Bab Boujloud is the easiest way to enter ... Read more Next Stay informed on our latest news!Send Discover Morocco History and geography Eco-friendly Travel in Morocco Contemporary Morocco UNESCO World Heritage Site Blog Places to go Casablanca Chefchaouen Errachidia-Midelt-Merzouga Essaouira-Mogador Ifrane Tangier Explore more cities See & do Suggested tours Culture Nature Beach Shopping Sport Wellness Travel info Events Getting around Morocco Accomodation Getting to Morocco Food & drinks Iconic things ABOUT US Terms of use Contact us ----------- Photo gallery Video gallery Copyright © 2024, Moroccan National Tourism Office. Newsletter subscription Thank you! your subscription has been successfully registered.Please check your inbox to confirm your newsletter subscription. Ok"
    },
    {
        "url": "https://www.visitmorocco.com/en/suggested-tours",
        "title": "Suggested tours | Moroccan National Tourist Office",
        "text": "Suggested tours | Moroccan National Tourist Office Kingdom of light Land of football PlaceMorocco, Land of Football English FrançaisEspañolItalianoDeutschPortugueseNederlandsРусскийSvenskaPolskiالعربية Discover Morocco Official website of the Moroccan National Tourism Office (MNTO), in charge of promoting Morocco's destination to national and international tourists History and geography History Medinas Historic landmarks Geography Historic sites and icons Art & Culture Gastronomy Local products Moroccan Traditional craft Moroccan hospitality Lifestyle Contemporary Morocco International brands Culture & cinema Modern Morocco An impressive heritage of humanity recognized by UNESCO Discover Eco-responsible, fair and sustainable tourism in Morocco Discover Places to goNature and discovery of rural heritage Chefchaouen Errachidia-Midelt-Merzouga Taroudant Azilal Ifrane Ouarzazate-Zagora-TinghirBeaches, sports and leisure activities Oujda-Saidia Dakhla Safi Al Hoceima Agadir-TaghazoutMedinas and beaches Tetouan Tangier Essaouira-Mogador El Jadida-Mazagan CasablancaMedinas & cultural heritage immersion Meknes Rabat Fez Marrakech Top destination ❤ Chefchaouen, the charming bride See & do Medina Medinas Museums & galleries Culture & Cinema Lifestyle Nature Nature & Mountains Parks & green spaces Moroccan gardens Walks & rambles Desert Sport Sport & nature Nautical sport Trekking Golf in Morocco Beach Gastronomy Shopping Wellness Suggested tours Cruises Desert break Imperial cities Road of 1000 Kasbahs Honey tour Great tour of Morocco Golf MICE Travel info Getting to Morocco Accomodation Getting around Morocco Kingdom of light Food & drinks MUST-KNOW THINGS Welcome back Land of football Travel guide Climate and seasons Formalities Moroccan National Tourist Office Language and essential vocabulary Health and well-being Currency in Morocco Time zone and calendar Means of communication Useful apps for travelling in Morocco Blog Our latest articles Golf in Morocco, a hundred-year-old history Embark on an enveloping wellness break in Morocco! An influencer quote Marina & Ben Shem Hooda All the favorites Culture Chefchaouen is considered to be the most \"instagrammable\" city in Morocco Tangier and Chefchaouen chosen for the shooting of the new Louis Vuitton All the videos Rewards & Considerations Discover SearchSearch English FrançaisEspañolItalianoDeutschPortugueseNederlandsРусскийSvenskaPolskiالعربية MENUSearch form SearchSearch Discover Morocco History and geography HistoryMedinasHistoric landmarks GeographyHistoric sites and icons Art & Culture GastronomyLocal productsMoroccan Traditional craftMoroccan hospitalityLifestyle Contemporary Morocco International brandsCulture & cinemaModern Morocco Places to go Nature and discovery of rural heritage Chefchaouen, the charming brideErrachidia-Midelt-MerzougaTaroudantAzilalIfraneOuarzazate-Zagora-Tinghir Medinas and beaches TetouanTangierEssaouira-MogadorEl Jadida-MazaganCasablanca Beaches, sports and leisure activities Oujda-SaïdiaDakhlaSafiAl HoceimaAgadir-Taghazout Medinas & cultural heritage immersion MeknesRabatFezMarrakech Top destination See & do Medina MedinasMuseums & galleriesCulture & CinemaLifestyle Nature Nature & MountainsParks & green spacesMoroccan gardensWalks & ramblesDesert Sport Sport & natureNautical sportTrekkingGolf in MoroccoBeachGastronomyShoppingWellness Suggested tours CruisesDesert breakImperial citiesRoad of 1000 KasbahsHoney tourGreat tour of MoroccoGolfMICE Travel info Getting to MoroccoAccomodationGetting around MoroccoKingdom of lightFood & drinksMUST-KNOW THINGS Welcome backLand of football Travel guide Climate and seasons Formalities Moroccan National Tourist Office Language and essential vocabulary Health and well-being Currency in Morocco Time zone and calendar Means of communication Useful apps for travelling in Morocco Blog Our latest articlesAn influencer quoteCulturevideos Rewards and considerations HomeSuggested tours JavaScript is Disabled! Activate javascript for better experience Suggested tours The honey road Discovering the fabulous valley of paradiseLet yourself be tempted by one of the most pleasant excursions in the heart of the Imouzzer mountain region of the Ida-Outanane. Located in the northern region a few kilometers from Agadir, the town of Imouzzer is famous for its honey and beautiful waterfalls.This famous beekeeping tour begins in the valley of paradise, which is the ... Read more The road to the kasbahs Explore the highlights of each city of the Great South Do you dream of exploring as many landscapes as Morocco has to offer ? Ouarzazate, Zagora and Tinghir are the perfect place for departures in organized tours. In the company of a guide, explore the great south thanks to 4*4 or quad tours on the road of the 1000 Kasbahs or through the Dades or Draa valleys. ... Read more Great tour of Morocco Explore the best of MoroccoBe ready for an exceptional great tour of Morocco ! During two weeks, you'll explore the most awe-inspiring aspects of Morocco. From North to South, choose your starting point and don't miss out any opportunity to discover all the treasures of the country.Nature, culture, sea, desert, and mountains, Morocco is a country of contrasts. Take the ... Read more Make the most of your next stopover Discover Morocco by cruiseTake a seat on the boat and get started for an eye-opening experience. Head out to the best stopover by the sea in Morocco, for an unforgettable stay.Let the cruise take you from the Atlantic coast, leaving the bride of the North, Tangier, towards the very wellknown seaside resort of Agadir. Dont miss passing through Casablanca, the country's ... Read more Imperial cities Travel back in time by visiting the imperial citiesFor a special time in imperial cities, dive into the country’s most important heritage sites and uncover the secrets of glorious dynasties ! Set out on a seven-day tour and let yourself be intrigued by the mysteries !The stages of this itinerary will introduce you to the four most historical and beautiful cities in ... Read more Desert Break Uncover the untainted beauty of the Moroccan DesertThe south of Morocco is the gate that leads to Sahara desert. In the middle of these stretches of sand, discover a world of dunes, sunshine and tranquility. Venture out there and experience the lifestyle of the nomadic tribes of the Sahara on your own.Marrakech and Agadir both lead to Sahara, and so is Fez. From the ... Read more Golf The pleasures of golf in MoroccoIn Morocco, golf is a little more than a sport, it's a tradition! For a little over a century, courses have been dotted around the country: today there are 37 of them, giving you the opportunity to practice your passion in the best conditions, in the middle of splendid settings and taking advantage of the most modern infrastructures.In the north ... Read more MICE Moroccan hotels, exhibitions and activities can cater to any of your incentives and meetings !Choose Morocco for your professional events. Come with your bucket list and make your own decisions.Every type of incentiveWe have been welcoming international companies and associations here for a long time for conferences, events and conventions organisation. Everywhere in Morocco ... Read more Stay informed on our latest news!Send Discover Morocco History and geography Eco-friendly Travel in Morocco Contemporary Morocco UNESCO World Heritage Site Blog Places to go Casablanca Chefchaouen Errachidia-Midelt-Merzouga Essaouira-Mogador Ifrane Tangier Explore more cities See & do Suggested tours Culture Nature Beach Shopping Sport Wellness Travel info Events Getting around Morocco Accomodation Getting to Morocco Food & drinks Iconic things ABOUT US Terms of use Contact us ----------- Photo gallery Video gallery Copyright © 2024, Moroccan National Tourism Office. Newsletter subscription Thank you! your subscription has been successfully registered.Please check your inbox to confirm your newsletter subscription. Ok"
    },
    {
        "url": "https://www.visitmorocco.com/en/see-do",
        "title": "See and do | Moroccan National Tourist Office",
        "text": "See and do | Moroccan National Tourist Office Kingdom of light Land of football PlaceMorocco, Land of Football English FrançaisEspañolItalianoDeutschPortugueseNederlandsРусскийSvenskaPolskiالعربية Discover Morocco Official website of the Moroccan National Tourism Office (MNTO), in charge of promoting Morocco's destination to national and international tourists History and geography History Medinas Historic landmarks Geography Historic sites and icons Art & Culture Gastronomy Local products Moroccan Traditional craft Moroccan hospitality Lifestyle Contemporary Morocco International brands Culture & cinema Modern Morocco An impressive heritage of humanity recognized by UNESCO Discover Eco-responsible, fair and sustainable tourism in Morocco Discover Places to goNature and discovery of rural heritage Chefchaouen Errachidia-Midelt-Merzouga Taroudant Azilal Ifrane Ouarzazate-Zagora-TinghirBeaches, sports and leisure activities Oujda-Saidia Dakhla Safi Al Hoceima Agadir-TaghazoutMedinas and beaches Tetouan Tangier Essaouira-Mogador El Jadida-Mazagan CasablancaMedinas & cultural heritage immersion Meknes Rabat Fez Marrakech Top destination ❤ Chefchaouen, the charming bride See & do Medina Medinas Museums & galleries Culture & Cinema Lifestyle Nature Nature & Mountains Parks & green spaces Moroccan gardens Walks & rambles Desert Sport Sport & nature Nautical sport Trekking Golf in Morocco Beach Gastronomy Shopping Wellness Suggested tours Cruises Desert break Imperial cities Road of 1000 Kasbahs Honey tour Great tour of Morocco Golf MICE Travel info Getting to Morocco Accomodation Getting around Morocco Kingdom of light Food & drinks MUST-KNOW THINGS Welcome back Land of football Travel guide Climate and seasons Formalities Moroccan National Tourist Office Language and essential vocabulary Health and well-being Currency in Morocco Time zone and calendar Means of communication Useful apps for travelling in Morocco Blog Our latest articles Golf in Morocco, a hundred-year-old history Embark on an enveloping wellness break in Morocco! An influencer quote Marina & Ben Shem Hooda All the favorites Culture Chefchaouen is considered to be the most \"instagrammable\" city in Morocco Tangier and Chefchaouen chosen for the shooting of the new Louis Vuitton All the videos Rewards & Considerations Discover SearchSearch English FrançaisEspañolItalianoDeutschPortugueseNederlandsРусскийSvenskaPolskiالعربية MENUSearch form SearchSearch Discover Morocco History and geography HistoryMedinasHistoric landmarks GeographyHistoric sites and icons Art & Culture GastronomyLocal productsMoroccan Traditional craftMoroccan hospitalityLifestyle Contemporary Morocco International brandsCulture & cinemaModern Morocco Places to go Nature and discovery of rural heritage Chefchaouen, the charming brideErrachidia-Midelt-MerzougaTaroudantAzilalIfraneOuarzazate-Zagora-Tinghir Medinas and beaches TetouanTangierEssaouira-MogadorEl Jadida-MazaganCasablanca Beaches, sports and leisure activities Oujda-SaïdiaDakhlaSafiAl HoceimaAgadir-Taghazout Medinas & cultural heritage immersion MeknesRabatFezMarrakech Top destination See & do Medina MedinasMuseums & galleriesCulture & CinemaLifestyle Nature Nature & MountainsParks & green spacesMoroccan gardensWalks & ramblesDesert Sport Sport & natureNautical sportTrekkingGolf in MoroccoBeachGastronomyShoppingWellness Suggested tours CruisesDesert breakImperial citiesRoad of 1000 KasbahsHoney tourGreat tour of MoroccoGolfMICE Travel info Getting to MoroccoAccomodationGetting around MoroccoKingdom of lightFood & drinksMUST-KNOW THINGS Welcome backLand of football Travel guide Climate and seasons Formalities Moroccan National Tourist Office Language and essential vocabulary Health and well-being Currency in Morocco Time zone and calendar Means of communication Useful apps for travelling in Morocco Blog Our latest articlesAn influencer quoteCulturevideos Rewards and considerations HomeSee and do JavaScript is Disabled! Activate javascript for better experience See and do Shopping Go for a shopping spreeIs shopping your favorite experience when you choose a destination ? From the eye-popping wonder of the traditionnal souks, to new heights of luxury brands, explore what awaits for you in Morocco. You'll just be spoilt for choice ! Read more Wellness Wellness vibesSet out on the best wellness experience, indulge yourself with exceptional relaxation activities, while enjoying a mix between luxury and authenticity. From Hammam, to spas, and to traditional cure, you will never be the same again. Read more Medina A world of contrasting culturesExpand your stay and go for a wander to discover the hidden treasures left by history. Dive into Morocco's rich history and explore the magical cultural heritage, arts, and ancestral traditions of Morocco. Read more Beach A range of bluewaters awaits you !Ideally located between atlantic and mediterranean coasts, Morocco charms its visitors by its mind-blowing beaches. From Ain Dalia beach in the North, to the dragon island in the South, witness the beauty of Moroccan beaches ! Read more Nature Capture the beauty of natureNature lovers, adventurers, or simply a nature explorer ? Let the wonders of nature surprise you. Outstanding sceneries, Kasbahs, waterfalls and oasis, mountains... experiences that you wouldn't want to miss ! Read more Sport Get ready for sensational outdoors activitiesTick off the best activities you can do in the land of the rising sun ! From Golfing, to nautical surf, to hiking, there are many sports and physical recreation activities that delight avdenture lovers. Read more The welcoming Moroccan gastronomy Gastronomic journey with Moroccan flavours Morocco's culinary heritage embraces the deep-rooted traditions and cultural variety of the country. Couscous, Tajine, ... Read more Stay informed on our latest news!Send Discover Morocco History and geography Eco-friendly Travel in Morocco Contemporary Morocco UNESCO World Heritage Site Blog Places to go Casablanca Chefchaouen Errachidia-Midelt-Merzouga Essaouira-Mogador Ifrane Tangier Explore more cities See & do Suggested tours Culture Nature Beach Shopping Sport Wellness Travel info Events Getting around Morocco Accomodation Getting to Morocco Food & drinks Iconic things ABOUT US Terms of use Contact us ----------- Photo gallery Video gallery Copyright © 2024, Moroccan National Tourism Office. Newsletter subscription Thank you! your subscription has been successfully registered.Please check your inbox to confirm your newsletter subscription. Ok"
    }
]