[
    {
        "title": "Climate and seasons",
        "text": "Morocco is a land of contrasts. Bathed to the north by the waters of the Mediterranean, to the west by those of the Atlantic Ocean, it is also criss-crossed by the Rif and Atlas mountains and is subject to all sorts of climatic influences. The coastal regions are popular with the ..."
    },
    {
        "title": "Formalities",
        "text": "Do I need a visa to enter Morocco? What are the passport requirements? Get some essential information to make traveling easier.Visa and PassportThe need for a visa depends on your nationality. It is possible to submit and track applications for ..."
    },
    {
        "title": "Moroccan National Tourist Office",
        "text": "Upon your arrival to Morocco, don’t hesitate to head to or contact the head office of the Moroccan National Tourist Office which is based in Rabat. Both the Regional Delegations and the Regional and Provincial Councils of Tourism, widely present in the main cities of the country, will also be ..."
    },
    {
        "title": "Language and essential vocabulary",
        "text": "Visiting a country, is also learning a new language.Morocco has two official languages, Arabic and Amazigh. French is also spoken and understood by almost all Moroccans.Spanish is widely spoken in the northern and southern regions of ..."
    },
    {
        "title": "Health and well-being",
        "text": "Apart from universal vaccinations (tetanus, polio, whooping cough, diphtheria, hepatitis B), no additional vaccination is required to visit Morocco.Some vaccines are nevertheless useful for individual protection of the tourist. In case of extended rural stays, it is ..."
    },
    {
        "title": "Currency in Morocco",
        "text": "The official currency unit of Morocco is the Moroccan dirham (DH) which is abbreviate (MAD).Tickets : you will find tickets from 20-50-100-200 DHThe coins : The coins in use are 0.50-1-2-5 and 10 DH and ..."
    },
    {
        "title": "Time zone and calendar",
        "text": "During the sacred month of Ramadan, Morocco apply GMT and GMT+1 the rest of the year. It is very easy to adapt to this new schedule and you’ll enjoy every moment of your wonderful stay!The public holidays for the year 2018 are listed below : ..."
    },
    {
        "title": "Means of communication",
        "text": "Phone calls :To make calls from your mobile phone number, don't forget to contract the \"International\" option with your telephone operator.The network is generally well covered in Morocco.It is also possible to buy a Moroccan SIM smart card ..."
    },
    {
        "title": "Useful apps for travelling in Morocco",
        "text": "You’ll find below a non-exhaustive list of mobile applications that suit most travelers, which can be useful during your stay in Morocco. ..."
    }
]